SloPOS/free-harvest/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- USB: act as a CDC-ACM *device* so the dryer (USB host) can enumerate us.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_RX_BUFSIZE=1024
CONFIG_TINYUSB_CDC_TX_BUFSIZE=1024

# --- USB: also present a mass-storage volume.
#
# The genuine adapter is a COMPOSITE device - CDC-ACM on interface 0, MSC on
# interface 1 - and its volume carries esp/version.txt. The dryer's own strings
# put mass storage upstream of the serial port:
#
#     Waiting on USB MSC Init thread
#     USB MSC finished starting CDC thread
#
# Firmware 6.0.641041 completes a full handshake against a CDC-only adapter, so
# it does not require the volume. A 6.0.644170 machine answers UNIQUE and
# nothing else. This is the experiment for whether that is the difference.
CONFIG_TINYUSB_MSC_ENABLED=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# Keep logs on UART0 so they do not collide with the USB CDC data path.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# --- Flash: this module has 8MB; use it so two OTA slots fit.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# --- OTA: custom two-slot partition table (partitions.csv).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Larger HTTP request buffers so the OTA upload handler is comfortable.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# --- OTA safety net: make a bad update undo itself.
#
# The bootloader rewrites any PENDING_VERIFY slot to ABORTED on every boot
# (bootloader_support/src/bootloader_utility.c), so an image that never calls
# esp_ota_mark_app_valid_cancel_rollback() is abandoned at the next reboot and
# the previous slot runs instead. main.c confirms only once the adapter is
# actually reachable, so an update that breaks Wi-Fi reverts itself rather than
# costing a trip to the machine with a USB cable.
#
# NOTE: this is enforced by the BOOTLOADER, which OTA never rewrites. It only
# takes effect after bootloader.bin has been physically flashed at 0x0 once.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y



# --- TinyUSB task stack.
#
# The CDC RX callback runs on this task, and our frame observer writes each
# frame to the SPIFFS capture log from there - fopen/fprintf/fclose through VFS
# and newlib is far more stack-hungry than the 4096 default allows. The first
# inbound frame overflowed it and panicked the chip, which looked exactly like
# "the dryer stopped talking to us": the adapter rebooted, re-enumerated, and
# reported zero bytes received because the counter reset with it.
CONFIG_TINYUSB_TASK_STACK_SIZE=8192

# --- Socket budget.
#
# esp_http_server requires max_open_sockets + 3 <= CONFIG_LWIP_MAX_SOCKETS
# (httpd_main.c). With the IDF default of 10 and our max_open_sockets of 7 that
# is 7 + 3 = 10 of 10 - the web server consumes the ENTIRE socket table and
# leaves nothing for anything else.
#
# The failure is mobile-specific and looks like a server bug: a phone browser
# opens up to six parallel keep-alive connections (our page pulls the HTML plus
# four embedded PNGs), saturating all seven slots. accept() then needs a fresh
# descriptor, the system table is full, and it fails with ENFILE (errno 23) -
# before lru_purge can reclaim a slot. A desktop browser opens one or two
# connections and never trips it.
#
# 16 leaves six spare for MQTT, DNS and the captive-portal responder.
CONFIG_LWIP_MAX_SOCKETS=16
